import { HistoricalEvent } from '../types';

const historicalEvents: HistoricalEvent[] = [
  {
    id: 1,
    title: 'Основание завода',
    date: '1975',
    description: 'Начало строительства Ульяновского авиационного промышленного комплекса (УАПК), будущего "Авиастар".',
    imageUrl: '/src/images/ist1.jpg'
  },
  {
    id: 2,
    title: 'Построен «Ульяновск-Восточный»',
    date: '1983',
    description: 'Принят в эксплуатацию испытательный аэродром завода «Ульяновск-Восточный», взлётно-посадочная полоса аэродрома — одна из самых длинных в мире (5000 м).',
    imageUrl: '/src/images/ist2.png'
  },
  {
    id: 3,
    title: 'Первый полёт самолёта Ан-124 "Руслан"',
    date: '1985',
    description: 'Состоялся первый полёт тяжёлого транспортного самолёта Ан-124 "Руслан", крупнейшего серийного грузового самолёта в мире на тот момент.',
    imageUrl: '/src/images/ist3.jpg'
  },
  {
    id: 4,
    title: 'Первый полёт самолёта Ту-204',
    date: '1990',
    description: 'На заводе "Авиастар" началось серийное производство среднемагистрального пассажирского самолёта Ту-204.',
    imageUrl: '/src/images/ist4.jpg'
  },
  {
    id: 5,
    title: 'Преобразование в акционерное общество',
    date: '1992',
    description: 'Ульяновский авиационный промышленный комплекс преобразован в акционерное общество "Авиастар".',
    imageUrl: '/src/images/ist5.jpg'
  },
  {
    id: 6,
    title: 'Начало производства Ил-76МД-90А',
    date: '2010',
    description: 'На заводе "Авиастар" началось производство модернизированной версии военно-транспортного самолёта Ил-76МД-90А.',
    imageUrl: '/src/images/ist6.jpg'
  },
  {
    id: 7,
    title: 'Вхождение в состав ПАО "Ил"',
    date: '2021',
    description: 'АО "Авиастар-СП" вошло в состав ПАО "Ил" в качестве филиала.',
    imageUrl: '/src/images/ist7.png'
  },
  
];

export default historicalEvents;